; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	infrared2 - mode
	thermograph0 - mode
	infrared3 - mode
	thermograph1 - mode
	GroundStation2 - direction
	Star1 - direction
	Star0 - direction
	Star3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared3)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star0)
	(supports instrument4 thermograph0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument6 infrared3)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon5)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon10)
)
(:goal (and
	(pointing satellite0 Phenomenon10)
	(pointing satellite1 Star1)
	(pointing satellite4 Star1)
	(have_image Star3 thermograph1)
	(have_image Phenomenon5 thermograph0)
	(have_image Planet6 thermograph1)
	(have_image Planet7 thermograph1)
	(have_image Planet8 infrared3)
	(have_image Star9 thermograph0)
	(have_image Phenomenon10 thermograph0)
	(have_image Phenomenon11 thermograph1)
	(have_image Star12 infrared2)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 12
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite4 phenomenon11 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon11)
   goals met: 0 of 12
5. (turn_to satellite4 star0 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 star0)
   goals met: 0 of 12
6. (calibrate satellite4 instrument7 star0)
   added: (calibrated instrument7)
   goals met: 0 of 12
7. (turn_to satellite4 phenomenon11 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 phenomenon11)
   goals met: 0 of 12
8. (take_image satellite4 phenomenon11 instrument7 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 1 of 12
9. (turn_to satellite4 planet6 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 planet6)
   goals met: 1 of 12
10. (take_image satellite4 planet6 instrument7 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 2 of 12
11. (turn_to satellite4 planet7 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet7)
   goals met: 2 of 12
12. (take_image satellite4 planet7 instrument7 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 3 of 12
13. (turn_to satellite4 star1 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star1)
   goals met: 4 of 12
14. (turn_to satellite1 phenomenon10 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 12
15. (take_image satellite1 phenomenon10 instrument3 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 5 of 12
16. (turn_to satellite1 phenomenon5 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon5)
   goals met: 5 of 12
17. (take_image satellite1 phenomenon5 instrument3 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   goals met: 6 of 12
18. (turn_to satellite1 planet8 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet8)
   goals met: 6 of 12
19. (take_image satellite1 planet8 instrument3 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 7 of 12
20. (turn_to satellite1 star1 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star1)
   goals met: 8 of 12
21. (turn_to satellite0 phenomenon10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon10)
   goals met: 9 of 12
22. (turn_to satellite4 star3 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 star3)
   goals met: 8 of 12
23. (take_image satellite4 star3 instrument7 thermograph1)
   added: (have_image star3 thermograph1)
   goals met: 9 of 12
24. (turn_to satellite4 star1 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 star1)
   goals met: 10 of 12
25. (turn_to satellite1 star12 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star12)
   goals met: 9 of 12
26. (take_image satellite1 star12 instrument3 infrared2)
   added: (have_image star12 infrared2)
   goals met: 10 of 12
27. (turn_to satellite1 star1 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star1)
   goals met: 11 of 12
28. (turn_to satellite1 star9 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star9)
   goals met: 10 of 12
29. (take_image satellite1 star9 instrument3 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 11 of 12
30. (turn_to satellite1 star1 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star1)
   goals met: 12 of 12
